music_box_backend/app/serializers/user_serializer.rb

  def playlists
    self.object.playlists.map do |playlist|{
      id: playlist.id,
      name: playlist.name,
      songs: playlist.songs.map do |song|{
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = $1  [["user_id", 1]]
SELECT "songs".* FROM "songs" INNER JOIN "playlist_songs" ON "songs"."id" = "playlist_songs"."song_id" WHERE "playlist_songs"."playlist_id" = $1  [["playlist_id", 1]]